src/cf/maERP_ib/src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>CLASSE_0</name>
      <description>CLASSE 0 : COMPTES SPECIAUX</description>
      <code>000000</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>CLASSE_1</name>
      <description>CLASSE 1 : COMPTES DE FINANCEMENT PERMANENT</description>
      <code>100000</code>
      <childItems>
        <name>CapitauxPropres</name>
        <description>Capitaux propres</description>
        <code>110000</code>
        <childItems>
          <name>CapitalSocialOuPersonnel</name>
          <description>Capital social ou personnel</description>
          <code>111000</code>
          <childItems>
            <name>CapitalSocial</name>
            <description>Capital social</description>
            <code>111100</code>
          </childItems>
          <childItems>
            <name>FondsDeDotation</name>
            <description>Fonds de dotation</description>
            <code>111200</code>
          </childItems>
          <childItems>
            <name>CapitalPersonnel</name>
            <description>Capital personnel</description>
            <code>111700</code>
            <childItems>
              <name>CapitalIndividuel</name>
              <description>Capital individuel</description>
              <code>111710</code>
            </childItems>
            <childItems>
              <name>CompteDeLExploitant</name>
              <description>Compte de l'exploitant</description>
              <code>111750</code>
            </childItems>
          </childItems>
        </childItems>
      </childItems>
    </items>
    <items>
      <name>CLASSE_2</name>
      <description>CLASSE 2 : COMPTES D'ACTIF IMMOBILISE</description>
      <code>200000</code>
    </items>
    <items>
      <name>CLASSE_3</name>
      <description>CLASSE 3 : COMPTES D'ACTIF CIRCULANT</description>
      <code>300000</code>
      <childItems>
        <name>Stocks</name>
        <description>Stocks</description>
        <code>310000</code>
        <childItems>
          <name>Marchandises</name>
          <description>Marchandises</description>
          <code>311000</code>
          <childItems>
            <name>MarchandisesGroupeA</name>
            <description>Marchandises (groupe A)</description>
            <code>311100</code>
          </childItems>
          <childItems>
            <name>MarchandisesGroupeB</name>
            <description>Marchandises (groupe B)</description>
            <code>311200</code>
          </childItems>
        </childItems>
      </childItems>
      <childItems>
        <name>CreancesDeLActifCirculant</name>
        <description>Créances de l'actif circulant</description>
        <code>340000</code>
        <childItems>
          <name>EtatDebiteur</name>
          <description>Etat - débiteur</description>
          <code>345000</code>
          <childItems>
            <name>EtatTVARcupérable</name>
            <description>Etat - TVA récupérable</description>
            <code>345500</code>
            <childItems>
              <name>EtatTVARecupérableSurCharges</name>
              <description>Etat - TVA récupérable sur charges</description>
              <code>345520</code>
            </childItems>
          </childItems>
        </childItems>
      </childItems>
    </items>
    <items>
      <name>CLASSE_4</name>
      <description>CLASSE 4 : COMPTES DU PASSIF CIRCULANT</description>
      <code>400000</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>DettesDuPassifCirculant</name>
        <description>Dettes du passif circulant</description>
        <code>440000</code>
        <accountType>Passive</accountType>
        <childItems>
          <name>FournisseursEtComptesRattachés</name>
          <description>Fournisseurs et comptes rattachés</description>
          <code>441000</code>
          <accountType>Passive</accountType>
          <childItems>
            <name>Fournisseurs</name>
            <description>Fournisseurs</description>
            <code>441100</code>
            <accountType>Passive</accountType>
            <childItems>
              <name>FournisseursCategorieA</name>
              <description>Fournisseurs catégorie A</description>
              <code>441110</code>
              <accountType>Passive</accountType>
            </childItems>
            <childItems>
              <name>FournisseursCategorieB</name>
              <description>Fournisseurs catégorie B</description>
              <code>441120</code>
              <accountType>Passive</accountType>
            </childItems>
          </childItems>
        </childItems>
      </childItems>
    </items>
    <items>
      <name>CLASSE_5</name>
      <description>CLASSE 5 : COMPTES DE TRESORERIE</description>
      <code>500000</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>CLASSE_6</name>
      <description>CLASSE 6 : COMPTES DE CHARGES</description>
      <code>600000</code>
      <accountType>ActivePassive</accountType>
      <childItems>
        <name>ChargesDExploitation</name>
        <description>Charges d'exploitation</description>
        <code>610000</code>
        <accountType>ActivePassive</accountType>
        <childItems>
          <name>AchatsRevendusDeMarchandises</name>
          <description>Achats revendus de marchandises</description>
          <code>611000</code>
          <accountType>ActivePassive</accountType>
          <childItems>
            <name>AchatsDeMarchandisesGroupeA</name>
            <description>Achats de marchandises &quot;groupe A&quot;</description>
            <code>611100</code>
            <accountType>ActivePassive</accountType>
          </childItems>
          <childItems>
            <name>AchatsDeMarchandisesGroupeB</name>
            <description>Achats de marchandises &quot;groupe B&quot;</description>
            <code>611200</code>
            <accountType>ActivePassive</accountType>
          </childItems>
          <childItems>
            <name>VariationDeStocksDeMarchandises</name>
            <description>Variation de stocks de marchandises</description>
            <code>611400</code>
            <accountType>ActivePassive</accountType>
          </childItems>
        </childItems>
      </childItems>
    </items>
    <items>
      <name>CLASSE_7</name>
      <description>CLASSE 7 : COMPTES DE PRODUITS</description>
      <code>700000</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>CLASSE_8</name>
      <description>CLASSE 8 : COMPTES DE RESULTATS</description>
      <code>800000</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>CLASSE_9</name>
      <description>CLASSE 9 : COMPTES DE PRODUITS ET CHARGES REFLECHIS</description>
      <code>900000</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБыстрогоВыбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

src/cf/maERP_ib/src/ChartsOfAccounts/Хозрасчетный/Forms/ФормаСчета/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Родитель.ТолькоПросмотр = Объект.Предопределенный;
	
	Элементы.Вид.Доступность            = НЕ Объект.Предопределенный;
	Элементы.Забалансовый.Доступность   = НЕ Объект.Предопределенный;
	Элементы.Количественный.Доступность = НЕ Объект.Предопределенный;
	
	Если Параметры.Ключ.Пустая() И Параметры.ЗначениеКопирования.Пустая() Тогда
		Объект.Валютный       = Ложь;
		Объект.Количественный = Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		УправлениеФормой();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	УправлениеФормой();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	//ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ОбновитьПовторноИспользуемыеЗначения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Если задан субсчет, то в его коде должна быть точка
	Код      = Объект.Код;
	Родитель = Объект.Родитель;
	
	Если Найти(Код, ".") > 0 Тогда
		
		//Найдем код родителя, для этого найдем последнюю точку в коде счета
		ПозицияТочки = СтрДлина(Код);
		
		Пока Сред(Код, ПозицияТочки, 1) <> "." Цикл
			
			ПозицияТочки = ПозицияТочки - 1;
			
		КонецЦикла;
		
		КодРодителя    = Лев(Код, ПозицияТочки - 1);
		РодительПоКоду = НайтиРодителя(КодРодителя);
		
		Если НЕ ЗначениеЗаполнено(РодительПоКоду) Тогда
			
			ПоказатьПредупреждение( , ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("fr = 'Le plan comptable ne contient pas le code compte %1'; ru = 'План счетов не содержит счета с кодом %1'; en = 'The chart of accounts does not contain accounts with the %1 code'; es = 'El plan de cuentas no contiene una cuenta con el código %1'"),
				КодРодителя));
			
		ИначеЕсли РодительПоКоду <> Объект.Ссылка Тогда
			
			СвойстваТекущегоРодителя = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Объект.Родитель);
			
			Объект.Родитель       = РодительПоКоду;
			Объект.Вид            = СвойстваТекущегоРодителя.Вид;
			Объект.Забалансовый   = СвойстваТекущегоРодителя.Забалансовый;
			Объект.Количественный = СвойстваТекущегоРодителя.Количественный;
			Объект.Валютный       = СвойстваТекущегоРодителя.Валютный;
			
			Элементы.ВидыСубконтоВалютный.Видимость       = Объект.Валютный;
			Элементы.ВидыСубконтоКоличественный.Видимость = Объект.Количественный;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Объект.КодБыстрогоВыбора = СокрЛП(СтрЗаменить(Код, ".", ""));
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура РодительПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВалютныйПриИзменении(Элемент)
	
	ВалютныйПриИзмененииСервер();
	
КонецПроцедуры

&НаКлиенте
Процедура КоличественныйПриИзменении(Элемент)
	
	Элементы.ВидыСубконтоКоличественный.Видимость = Объект.Количественный;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗабалансовыйПриИзменении(Элемент)
	
	//Элементы.УчетПоНаправлениямДеятельности.Видимость = НЕ Объект.Забалансовый;
	//Если Объект.Забалансовый Тогда
	//	Объект.УчетПоНаправлениямДеятельности = Ложь;
	//КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ВидыСубконтоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыСубконтоПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.Предопределенное Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыСубконтоПередУдалением(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные.Предопределенное Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыСубконтоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.Суммовой       = Истина;
		Элемент.ТекущиеДанные.Валютный       = Истина;
		Элемент.ТекущиеДанные.Количественный = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ПодключаемыеКоманды
//&НаКлиенте
//Процедура Подключаемый_ВыполнитьКоманду(Команда)
//	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
//КонецПроцедуры

//&НаСервере
//Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
//	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
//КонецПроцедуры

//&НаКлиенте
//Процедура Подключаемый_ОбновитьКоманды()
//	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
//КонецПроцедуры
//// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция НайтиРодителя(КодРодителя)
	
	Возврат ПланыСчетов.Хозрасчетный.НайтиПоКоду(КодРодителя);
	
КонецФункции

&НаКлиенте
Процедура ПредупреждениеОНевозможностиИзмененияСоставаВидовСубконто(Отказ)
	
	ПоказатьПредупреждение( , НСтр("fr = 'La composition des sous-espèces dans ce compte est déterminée par le réglage des paramètres comptables.'; ru = 'Состав видов субконто на этом счете определяется настройкой параметров учета.'; en = 'The composition of the types of subcontracts on this account is determined by setting accounting parameters.'; es = 'La composición de las especies de subconto en esta cuenta está determinada por la configuración de los parámetros contables.'"));
	Отказ = Истина;
	
КонецПроцедуры // ПредупреждениеОНевозможностиИзмененияСоставаВидовСубконто()

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ВидыСубконтоВалютный.Видимость = Объект.Валютный;
	
КонецПроцедуры // УправлениеФормой()

&НаСервере
Процедура ВалютныйПриИзмененииСервер()
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти
